
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить();
	
	Движения.Продажи.Записывать = Истина;
	Движения.Продажи.Очистить();
	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТоваровСписокТоваров.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажаТоваровСписокТоваров.Количество) КАК Количество,
		|	СУММА(ПродажаТоваровСписокТоваров.Выручка) КАК Выручка,
		|	УчетнаяПолитикаСрезПоследних.МетодСписания
		|ПОМЕСТИТЬ ДокТЧ
		|ИЗ
		|	Документ.ПродажаТоваров.СписокТоваров КАК ПродажаТоваровСписокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитика.СрезПоследних(&МоментВремени, ) КАК УчетнаяПолитикаСрезПоследних
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ПродажаТоваровСписокТоваров.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТоваровСписокТоваров.Номенклатура,
		|	УчетнаяПолитикаСрезПоследних.МетодСписания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Номенклатура,
		|	ДокТЧ.МетодСписания
		|ИЗ
		|	ДокТЧ КАК ДокТЧ";
		
		Если Режим = РежимПроведенияДокумента.Оперативный Тогда
			Движения.ОстаткиТоваров.Записать();
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("Ссылка", Ссылка);

		РезультатПоТЧ = Запрос.Выполнить();
		Если РезультатПоТЧ.Пустой() Тогда
			Возврат;	
		КонецЕсли; 
		Данные = РезультатПоТЧ.Выбрать(); Данные.Следующий();
		УчетнаяПолитика = Данные.МетодСписания;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТоваров");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатПоТЧ;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		Блокировка.Заблокировать(); 
		 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДокТЧ.Номенклатура КАК Номенклатура,
		               |	ДокТЧ.Количество КАК Количество,
		               |	ДокТЧ.Выручка КАК Выручка,
		               |	ОстаткиТоваровОстатки.Партия,
		               |	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		               |	ОстаткиТоваровОстатки.СтоимостьОстаток
		               |ИЗ
		               |	ДокТЧ КАК ДокТЧ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		               |				&МоментВремени,
		               |				Номенклатура В
		               |					(ВЫБРАТЬ
		               |						ДокТЧ.Номенклатура
		               |					ИЗ
		               |						ДокТЧ КАК ДокТЧ)) КАК ОстаткиТоваровОстатки
		               |		ПО ДокТЧ.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ОстаткиТоваровОстатки.Партия.МоментВремени //ПризнакСортировки
		               |ИТОГИ
		               |	МАКСИМУМ(Количество),
		               |	МАКСИМУМ(Выручка),
		               |	СУММА(КоличествоОстаток)
		               |ПО
		               |	Номенклатура";

	Если УчетнаяПолитика = Перечисления.МетодыСписания.LIFO Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"//ПризнакСортировки",
			"УБЫВ");
	КонецЕсли; 

	Результат = Запрос.Выполнить();

	ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоОстаток Тогда
			Отказ = истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "мало товара " + ВыборкаНоменклатура.Номенклатура;
			Сообщение.Сообщить();
		КонецЕсли; 

		Если Отказ Тогда
			Продолжить;
		КонецЕсли; 
		
		ОсталосьСписать = ВыборкаНоменклатура.Количество;
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
        СебестоимостьИтого = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() И ОсталосьСписать <> 0 Цикл
			
			Списать = МИН(ОсталосьСписать, ВыборкаДетальныеЗаписи.КоличествоОстаток);
			Если Списать = ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
				Себестоимость = ВыборкаДетальныеЗаписи.СтоимостьОстаток;
			Иначе
				Себестоимость = Списать / ВыборкаДетальныеЗаписи.КоличествоОстаток * ВыборкаДетальныеЗаписи.СтоимостьОстаток;
			КонецЕсли; 
			
			СебестоимостьИтого = СебестоимостьИтого + Себестоимость;
			
			Движение = Движения.ОстаткиТоваров.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Партия = ВыборкаДетальныеЗаписи.Партия;
			Движение.Количество = Списать;
			Движение.Стоимость = Себестоимость;
			
			ОсталосьСписать = ОсталосьСписать - Списать;
		КонецЦикла;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		Движение.Себестоимость = СебестоимостьИтого;
		Движение.Выручка = ВыборкаНоменклатура.Выручка;
		
	КонецЦикла;

КонецПроцедуры
