#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Документ Поступление товаров: Создание").ВТранзакции()
   	.ДобавитьТест("ПроверкаСозданияПозитив", "", "Позитив")
	;

КонецПроцедуры

Процедура ПроверкаСозданияПозитив() Экспорт
	
	ВходныеПараметры = ВходныеПараметрыПриходаТовара();
	КонструкторОбъекта = КонструкторОбъектаПриходТовара(ВходныеПараметры); 
	ПоступлениеТоваровСсылка = КонструкторОбъекта.Записать();
	
	ЮТест.ОжидаетЧто(ПоступлениеТоваровСсылка)  // Объект, метод которого проверяем
		    .ИмеетТип(Тип("ДокументСсылка.ПоступлениеТоваров"), "Проверка, что значение имеет тип 'ДокументСсылка.ПоступлениеТоваров'")
		;
	
	
	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВходныеПараметрыПриходаТовара()

	ВходныеПараметры = Новый Структура;
	УИД = Новый УникальныйИдентификатор;
	НаименованиеТовара = Строка(УИД);
	ТоварНовый = СозданияТовара(НаименованиеТовара);
	ВходныеПараметры.Вставить("Товар",      ТоварНовый);
	ВходныеПараметры.Вставить("Цена",       36000);
	ВходныеПараметры.Вставить("Количество", 5);
	ВходныеПараметры.Вставить("Сумма",      180000);
		
	Возврат ВходныеПараметры;

КонецФункции // ()

Функция СозданияТовара(Наименование)
	
	КонструкторТовара = ЮТест.Данные().КонструкторОбъекта("Справочники.Номенклатура")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", Наименование)
		;
    ТоварНовый = КонструкторТовара.Записать();
	
	Возврат ТоварНовый;

КонецФункции

Функция КонструкторОбъектаПриходТовара(ВходныеПараметры)

	КонструкторПрихода = ЮТест.Данные().КонструкторОбъекта("Документы.ПоступлениеТоваров")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса())
		.ТабличнаяЧасть("СписокТоваров").ДобавитьСтроку()
			.Установить("Номенклатура", ВходныеПараметры.Товар)
			.Установить("Количество", ВходныеПараметры.Количество)
			.Установить("Стоимость", ВходныеПараметры.Сумма)
		;
		
	Возврат КонструкторПрихода;

КонецФункции // ()

#КонецОбласти